---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsCurveType
source: html/c0cb56ba-9b0f-c5b2-3d1e-3673efd563e3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsCurveType Property

"Stairs Line Type"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsCurveType { get; }
```